app/Http/Controllers/PagesController.php

select * from `departments` where `departments`.`id` in (1, 6)
select * from `fields` where `fields`.`id` in (1, 4)
select * from `positions` where `positions`.`id` in (10, 11)
select * from `users` where `users`.`id` in (1, 9)
select * from `categories` where `categories`.`id` in (1, 4)
select * from `posts` order by `created_at` desc limit 2 offset 0
select count(*) as aggregate from `posts`
select * from `users` where `role` = 'admin'
select * from `categories` where `categories`.`id` in (2)
select * from `events`
---
    public function home()
    {
        $title = '';
        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' in ' . $category->name;
        }

        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' by ' . $author->name;
        }
        return view('index', [

            "posts" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(2)->withQueryString(),
            "pengurus" => User::where('role', 'admin')->filter(request(['searchAdmin', 'field', 'department', 'position']))->get(),
            "events" => Event::with(['category'])->get(),
            "title" => "Home | HMSI UNPAM" . $title,
            "active" => "Home | HMSI UNPAM"
        ]);

select * from `archives`
---
    public function index()
    {
        return view('dashboard.index', [
            "anggota" => User::where('role', 'anggota')->latest()->filter(request(['field', 'department', 'position']))->paginate(5)->withQueryString(),
            "pengurus" => User::where('role', 'admin')->with(['field', 'department', 'position'])->get(),
            "archives" => Archive::all(),

select * from `categories` where `categories`.`id` in (1, 4)
select * from `posts`
select * from `departments` where `departments`.`id` in (3, 5, 6)
select * from `fields` where `fields`.`id` in (3, 4)
select * from `positions` where `positions`.`id` in (10)
select * from `users` where `role` = 'anggota' order by `created_at` desc limit 5 offset 0
select * from `departments` where `departments`.`id` in (1)
select * from `fields` where `fields`.`id` in (1, 4, 6, 7)
select * from `positions` where `positions`.`id` in (2, 6, 8, 9, 11)
select * from `users` where `role` = 'admin'
select * from `categories` where `categories`.`id` in (1)
select * from `posts` where `user_id` = 1 order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `posts` where `user_id` = 1
---
    public function anggota()
    {
        return view('dashboard.anggota', [
            "archives" => Archive::all(),
            "post" => Post::all(),
            "anggota" => User::where('role', 'anggota')->latest()->filter(request(['field', 'department', 'position']))->paginate(5)->withQueryString(),
            "pengurus" => User::where('role', 'admin')->with(['field', 'department', 'position'])->get(),
            "posts" => Post::where('user_id', auth()->id())->latest()->filter(request(['search', 'category', 'author']))->paginate(5)->withQueryString(),
            "title" => "Dashboard Anggota | HMSI UNPAM",

        ]);